import 'package:flutter/material.dart';
import 'package:hafez_poems/Initializers_and_Boot/app_initializer.dart';
import 'package:hafez_poems/Initializers_and_Boot/main_app.dart';

void main() async {
  WidgetsFlutterBinding.ensureInitialized();
  await AppInitializer.run();
  runApp(const MainApp());
}

//? new futures ---------
//todo: بهبود ظاهری صفحه اشعار
//todo: بهبود ظاهری صفحه فال
//todo: افزودن بخش پادکست ها
//todo: افزودن بخش کمک مشاعره از دیوان حافظ
//todo: تنظیم فونت رنگ و سایز متن در اشتراک گذاری مصرع

//! claude
// جست و جو بر اساس اعداد اشتباه است.
// ایکون انتخاب یک خواننده برای یک نوع شعر روی تمامی اون مدل شعر اعمال نمیشه همراه با پیغام مناسب
// حذف ایکون تیک به معنای انتخاب خواننده
// نمایش خطاهای اسنکبار صدا و دانلود صدا با اسنک خودمون
// حذف ایکون ضربدر از بخش کالکشن در نوبار
// کوپک تر کردن سایز کلی اسنکبار
// بهبود انتخاب فایل صوتی افلاین در دانلود
// عدم نمایش سینک بودن متن درحالت افلاین
// باگ دکمه اتمام در حالت افلاین
// اگر کاربر به اینترنت متصل بود که هیچ. اگر نبود ولی فایل صوتی دانلود داشت پیغام موجود فایل صوتی نمایش داده شود در غیر این صورت پیغام خطای اتصال
// روی دکمه انتخاب خواننده و دانلود که روی ویجت صدا قرار دارد بجای نمایش نام خوااننده متن "انتخاب خواننده | دانلود" نمایش داده شود
